/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50505
Source Host           : localhost:3306
Source Database       : demo

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2018-06-20 23:43:23
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `client`
-- ----------------------------
DROP TABLE IF EXISTS `client`;
CREATE TABLE `client` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `nam` char(50) DEFAULT NULL,
  `PSW` char(20) DEFAULT NULL,
  `TELE` char(13) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of client
-- ----------------------------
INSERT INTO `client` VALUES ('8', 'server1', '123', '123');
INSERT INTO `client` VALUES ('16', '123', '123', '123');
INSERT INTO `client` VALUES ('20', 'adf', 'we', 'adsf');
INSERT INTO `client` VALUES ('22', '肖昭颢', '123123', '18813136860');
INSERT INTO `client` VALUES ('23', '苏志远老师', '123456', '12345678');
INSERT INTO `client` VALUES ('24', 'Ronal', '123456', '18813136860');
INSERT INTO `client` VALUES ('25', 'server1', '123123', '18813136860');
INSERT INTO `client` VALUES ('26', '1234', '123123123', '18813136860');
INSERT INTO `client` VALUES ('27', '12345', '123123134', '18813136860');
INSERT INTO `client` VALUES ('28', '1235', '1231321', '18813136860');
INSERT INTO `client` VALUES ('29', '1324523', '131252134', '18813136860');
INSERT INTO `client` VALUES ('30', '13241234', '1231', '18813136860');
INSERT INTO `client` VALUES ('31', 'afasdf', 'afgaedgasdferg', '18813136860');
INSERT INTO `client` VALUES ('32', 'asdfsfdbxcvb', 'ageregcvb', '18813136860');
INSERT INTO `client` VALUES ('33', 'fgjgfhd', 'dgncbxc', '18813136860');
INSERT INTO `client` VALUES ('34', 'fkgj45g', 'adcxvbwerer', '18813136860');
INSERT INTO `client` VALUES ('35', 'asdfbcxbj', '135ewrgsdfgsd', '18813136860');

-- ----------------------------
-- Table structure for `in_orders`
-- ----------------------------
DROP TABLE IF EXISTS `in_orders`;
CREATE TABLE `in_orders` (
  `id` int(20) unsigned NOT NULL AUTO_INCREMENT,
  `parts` char(50) NOT NULL,
  `car` char(50) NOT NULL,
  `number` int(50) NOT NULL,
  `date` date NOT NULL,
  `server` char(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of in_orders
-- ----------------------------
INSERT INTO `in_orders` VALUES ('1', '火花塞', '卡罗拉', '12', '2018-06-27', '123');

-- ----------------------------
-- Table structure for `orders`
-- ----------------------------
DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `parts` char(50) NOT NULL,
  `car` char(50) NOT NULL,
  `name` char(50) NOT NULL,
  `tel` char(13) NOT NULL,
  `bank` char(50) NOT NULL,
  `card_id` char(50) NOT NULL,
  `date` date NOT NULL,
  `sex` char(5) DEFAULT NULL,
  `remark` char(200) DEFAULT NULL,
  `number` int(10) unsigned NOT NULL,
  `statu` char(6) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of orders
-- ----------------------------
INSERT INTO `orders` VALUES ('1', '火花塞', '卡罗拉', '肖昭颢', '18813136860', '中国工商银行', '123546789123456789', '2018-06-10', '男', null, '50', '未完成');
INSERT INTO `orders` VALUES ('2', '蓄电池', '英朗', '肖昭颢', '18813136860', '中国农业银行', '123456789123456789', '2018-06-27', '男', null, '20', '未完成');
INSERT INTO `orders` VALUES ('5', '雨刮器', '英朗', '肖昭颢', '18813136860', '中国建设银行', '241341432141', '2018-06-22', '男', '', '0', '已完成');
INSERT INTO `orders` VALUES ('8', '滤清器', '英朗', '曾泽文', '13212312141', '中国建设银行', '123412341241234', '2018-06-29', '女', '', '30', '未完成');
INSERT INTO `orders` VALUES ('9', '雨刮器', '卡罗拉', '大老板', '13354462554', '中国农业银行', '123123123123123', '2018-08-30', '男', '我有钱', '16', '未完成');
INSERT INTO `orders` VALUES ('10', '滤清器', '英朗', '小美', '18813136860', '中国建设银行', '132412342314', '2018-08-03', '男', '', '50', '未完成');
INSERT INTO `orders` VALUES ('11', '刹车片', '速腾', '肖昭颢', '18813136860', '招商银行', '123456789987987', '2020-06-12', '男', '默认添加信息', '40', '未完成');
INSERT INTO `orders` VALUES ('12', '雨刮器', '英朗', '肖昭颢', '13960552256', '交通银行', '123123123123123', '2018-06-22', '男', '不加糖', '80', '未完成');
INSERT INTO `orders` VALUES ('13', '滤清器', '英朗', '张小三', '18732213132', '中国建设银行', '123123123123123', '2019-06-26', '男', '', '120', '未完成');
INSERT INTO `orders` VALUES ('14', '火花塞', '思域', '李四', '18813136860', '交通银行', '78978787975465465', '2018-07-27', '男', '张三李四', '500', '未完成');
INSERT INTO `orders` VALUES ('15', '蓄电池', '宝骏', '赫晴画', '131708018277', '中信银行', '6217002710000684874', '2017-08-12', '男', '', '64', '未完成');
INSERT INTO `orders` VALUES ('16', '金属刹车片', '雅阁', '蓬和豫', '189994563706', '中国邮政储蓄银行', '6217002710000684874', '2017-08-31', '男', '', '98', '未完成');
INSERT INTO `orders` VALUES ('17', '汽机油', '宝骏', '候凝雁', '132398996859', '中国邮政储蓄银行', '6217002710000684874', '2017-07-11', '女', '', '18', '未完成');
INSERT INTO `orders` VALUES ('18', '火花塞', '哈弗H6', '本俊发', '150405750727', '交通银行', '6217002710000684874', '2017-09-28', '男', '', '180', '未完成');
INSERT INTO `orders` VALUES ('19', '金属刹车片', '宝来', '甫云露', '189400132697', '中国民生银行', '6217002710000684874', '2017-12-17', '男', '', '100', '未完成');
INSERT INTO `orders` VALUES ('20', '金属刹车片', '英朗', '丁飞扬', '156711698316', '中信银行', '6217002710000684874', '2017-11-01', '男', '', '72', '未完成');
INSERT INTO `orders` VALUES ('21', '防冻液', '哈弗H6', '务鸿德', '154574464233', '中国邮政储蓄银行', '6217002710000684874', '2017-07-16', '男', '', '86', '未完成');
INSERT INTO `orders` VALUES ('22', '雨刮器', '宝马', '卜香天', '139476813669', '中国工商银行', '6217002710000684874', '2017-08-19', '男', '', '192', '未完成');
INSERT INTO `orders` VALUES ('23', '柴油机', '哈弗H6', '亓官安然', '153861576672', '中信银行', '6217002710000684874', '2017-07-08', '女', '', '172', '未完成');
INSERT INTO `orders` VALUES ('24', '汽机油', '迈腾', '少骏琛', '132508923109', '中国民生银行', '6217002710000684874', '2017-08-24', '女', '', '134', '未完成');
INSERT INTO `orders` VALUES ('25', '转向助力液', '宝来', '无晏静', '188187239452', '交通银行', '6217002710000684874', '2017-07-14', '男', '', '48', '未完成');
INSERT INTO `orders` VALUES ('26', '陶瓷刹车片', '迈腾', '宛康平', '137555860274', '中国农业银行', '6217002710000684874', '2017-10-21', '女', '', '60', '未完成');
INSERT INTO `orders` VALUES ('27', '雨刮器', '卡罗拉', '凤令雪', '139766126047', '中国工商银行', '6217002710000684874', '2017-07-27', '男', '', '58', '未完成');
INSERT INTO `orders` VALUES ('28', '转向助力液', '英朗', '关成礼', '155113260577', '上海浦东发展银行', '6217002710000684874', '2017-07-06', '男', '', '154', '未完成');
INSERT INTO `orders` VALUES ('29', '陶瓷刹车片', '宝骏', '恽虹英', '137894069470', '交通银行', '6217002710000684874', '2017-07-02', '女', '', '164', '未完成');
INSERT INTO `orders` VALUES ('30', '陶瓷刹车片', '哈弗H6', '公孙彬彬', '157673823879', '中国建设银行', '6217002710000684874', '2017-08-15', '女', '', '30', '未完成');
INSERT INTO `orders` VALUES ('31', '雨刮器', '奥迪A13L', '越乐天', '132995812429', '中国民生银行', '6217002710000684874', '2017-07-14', '男', '', '88', '未完成');
INSERT INTO `orders` VALUES ('32', '雨刮器', '宝骏', '鲁叶飞', '139493128664', '上海浦东发展银行', '6217002710000684874', '2017-08-10', '男', '', '118', '未完成');
INSERT INTO `orders` VALUES ('33', '金属刹车片', '凯美瑞', '冉子爱', '156246234526', '交通银行', '6217002710000684874', '2017-12-07', '男', '', '94', '未完成');
INSERT INTO `orders` VALUES ('34', '火花塞', '宝马', '勤雨晨', '130992027518', '中国工商银行', '6217002710000684874', '2017-07-14', '男', '', '46', '未完成');
INSERT INTO `orders` VALUES ('35', '火花塞', '英朗', '摩弘亮', '150715529028', '中国农业银行', '6217002710000684874', '2017-12-14', '男', '', '8', '未完成');
INSERT INTO `orders` VALUES ('36', '柴油机', '凯美瑞', '逯香巧', '153932389077', '中国农业银行', '6217002710000684874', '2017-12-19', '女', '', '154', '未完成');
INSERT INTO `orders` VALUES ('37', '火花塞', '雅阁', '盈浩波', '180510933682', '中国建设银行', '6217002710000684874', '2017-11-11', '男', '', '60', '未完成');
INSERT INTO `orders` VALUES ('38', '卡钳总成', '卡罗拉', '书永元', '138977500992', '中国邮政储蓄银行', '6217002710000684874', '2017-09-28', '女', '', '2', '未完成');
INSERT INTO `orders` VALUES ('39', '汽机油', '宝来', '章古兰', '185641207396', '中国农业银行', '6217002710000684874', '2017-07-23', '女', '', '62', '未完成');
INSERT INTO `orders` VALUES ('40', '汽机油', '雅阁', '石浩波', '185169842416', '交通银行', '6217002710000684874', '2017-10-02', '女', '', '180', '未完成');
INSERT INTO `orders` VALUES ('41', '陶瓷刹车片', '宝来', '籍秀筠', '130489759049', '上海浦东发展银行', '6217002710000684874', '2017-12-08', '女', '', '6', '未完成');
INSERT INTO `orders` VALUES ('42', '蓄电池', '宝马', '惠春柏', '131764031829', '中国农业银行', '6217002710000684874', '2017-08-21', '男', '', '116', '未完成');
INSERT INTO `orders` VALUES ('43', '汽机油', '奥迪A6L', '巨柔谨', '185639668509', '中信银行', '6217002710000684874', '2017-11-22', '女', '', '100', '未完成');
INSERT INTO `orders` VALUES ('44', '陶瓷刹车片', '宝马', '乐忆文', '137421589031', '中信银行', '6217002710000684874', '2017-10-22', '女', '', '132', '未完成');
INSERT INTO `orders` VALUES ('45', '蓄电池', '哈弗H6', '禾英卫', '151167622217', '中国民生银行', '6217002710000684874', '2017-09-25', '男', '', '24', '未完成');
INSERT INTO `orders` VALUES ('46', '卡钳总成', '英朗', '稽和顺', '158621365945', '中国工商银行', '6217002710000684874', '2017-09-12', '女', '', '148', '未完成');
INSERT INTO `orders` VALUES ('47', '蓄电池', '雅阁', '弘锐逸', '182437446072', '招商银行', '6217002710000684874', '2017-09-24', '男', '', '10', '未完成');
INSERT INTO `orders` VALUES ('48', '蓄电池', '宝来', '军凝冬', '182383852498', '中国工商银行', '6217002710000684874', '2017-08-30', '男', '', '188', '未完成');
INSERT INTO `orders` VALUES ('49', '防冻液', '奥迪A8L', '刁初南', '187642873041', '中国工商银行', '6217002710000684874', '2017-08-18', '男', '', '136', '未完成');
INSERT INTO `orders` VALUES ('50', '蓄电池', '英朗', '塔高雅', '151592621772', '中国建设银行', '6217002710000684874', '2017-07-29', '男', '', '164', '未完成');
INSERT INTO `orders` VALUES ('51', '火花塞', '宝来', '资香巧', '180521024523', '中国邮政储蓄银行', '6217002710000684874', '2017-10-07', '男', '', '38', '未完成');
INSERT INTO `orders` VALUES ('52', '卡钳总成', '迈腾', '哀昊然', '138743935696', '中国建设银行', '6217002710000684874', '2017-09-06', '女', '', '146', '未完成');
INSERT INTO `orders` VALUES ('53', '汽机油', '哈弗H6', '章佳鸿文', '152292869512', '上海浦东发展银行', '6217002710000684874', '2017-12-08', '女', '', '194', '未完成');
INSERT INTO `orders` VALUES ('54', '卡钳总成', '奥迪A12L', '陆雅逸', '131984704360', '交通银行', '6217002710000684874', '2017-12-16', '女', '', '46', '未完成');
INSERT INTO `orders` VALUES ('55', '防冻液', '英朗', '隗浩慨', '154549584216', '中国民生银行', '6217002710000684874', '2017-09-06', '男', '', '128', '未完成');
INSERT INTO `orders` VALUES ('56', '转向助力液', '卡罗拉', '毛辰龙', '135214242716', '中国民生银行', '6217002710000684874', '2017-10-23', '男', '', '160', '未完成');
INSERT INTO `orders` VALUES ('57', '卡钳总成', '宝骏', '涂沈雅', '138576097046', '中国民生银行', '6217002710000684874', '2017-08-04', '女', '', '4', '未完成');
INSERT INTO `orders` VALUES ('58', '火花塞', '凯美瑞', '之晓昕', '150747585207', '中信银行', '6217002710000684874', '2017-07-22', '男', '', '82', '未完成');
INSERT INTO `orders` VALUES ('59', '防冻液', '迈腾', '伯宜然', '134304526207', '中信银行', '6217002710000684874', '2017-12-19', '男', '', '182', '未完成');
INSERT INTO `orders` VALUES ('60', '蓄电池', '奥迪A5L', '出诗丹', '182434130726', '上海浦东发展银行', '6217002710000684874', '2017-11-09', '男', '', '44', '未完成');
INSERT INTO `orders` VALUES ('61', '雨刮器', '英朗', '司马吉星', '159476349183', '中国农业银行', '6217002710000684874', '2017-12-19', '男', '', '164', '未完成');
INSERT INTO `orders` VALUES ('62', '蓄电池', '凯美瑞', '太叔听双', '151130686640', '中国邮政储蓄银行', '6217002710000684874', '2017-09-08', '男', '', '34', '未完成');
INSERT INTO `orders` VALUES ('63', '防冻液', '凯美瑞', '闾丘鸣玉', '154765492227', '中国建设银行', '6217002710000684874', '2017-09-01', '男', '', '98', '未完成');
INSERT INTO `orders` VALUES ('64', '火花塞', '迈腾', '歧元化', '130591552977', '招商银行', '6217002710000684874', '2017-09-06', '男', '', '116', '未完成');
INSERT INTO `orders` VALUES ('65', '防冻液', '宝来', '淡茗雪', '187139975483', '招商银行', '6217002710000684874', '2017-10-18', '男', '', '60', '未完成');
INSERT INTO `orders` VALUES ('66', '柴油机', '卡罗拉', '包阳朔', '133472531461', '招商银行', '6217002710000684874', '2017-12-22', '女', '', '26', '未完成');
INSERT INTO `orders` VALUES ('67', '金属刹车片', '哈弗H6', '寇蕴藉', '156833999000', '中国农业银行', '6217002710000684874', '2017-09-25', '男', '', '102', '未完成');
INSERT INTO `orders` VALUES ('68', '雨刮器', '哈弗H6', '东郭浩言', '159594291141', '交通银行', '6217002710000684874', '2017-12-06', '男', '', '26', '未完成');
INSERT INTO `orders` VALUES ('69', '陶瓷刹车片', '雅阁', '御成仁', '130674733469', '中国工商银行', '6217002710000684874', '2017-09-03', '女', '', '82', '未完成');
INSERT INTO `orders` VALUES ('70', '柴油机', '迈腾', '卫学义', '133200179555', '上海浦东发展银行', '6217002710000684874', '2017-08-16', '女', '', '96', '未完成');
INSERT INTO `orders` VALUES ('71', '防冻液', '卡罗拉', '闾高阳', '134267649473', '交通银行', '6217002710000684874', '2017-09-16', '男', '', '56', '未完成');
INSERT INTO `orders` VALUES ('72', '卡钳总成', '凯美瑞', '闳怀雁', '158818293426', '上海浦东发展银行', '6217002710000684874', '2017-09-26', '女', '', '116', '未完成');
INSERT INTO `orders` VALUES ('73', '金属刹车片', '宝马', '接雅静', '136293094719', '上海浦东发展银行', '6217002710000684874', '2017-08-22', '男', '', '84', '未完成');
INSERT INTO `orders` VALUES ('74', '陶瓷刹车片', '奥迪A11L', '种囡囡', '130867872724', '招商银行', '6217002710000684874', '2017-10-08', '女', '', '148', '未完成');
INSERT INTO `orders` VALUES ('75', '防冻液', '宝骏', '佟佳兰月', '134510879208', '中国农业银行', '6217002710000684874', '2017-08-16', '男', '', '128', '未完成');
INSERT INTO `orders` VALUES ('76', '汽机油', '宝马', '秘清雅', '132457206665', '中国建设银行', '6217002710000684874', '2017-07-05', '女', '', '154', '未完成');
INSERT INTO `orders` VALUES ('77', '柴油机', '奥迪A7L', '巧雨竹', '186683475446', '中国邮政储蓄银行', '6217002710000684874', '2017-12-15', '女', '', '8', '未完成');
INSERT INTO `orders` VALUES ('78', '汽机油', '卡罗拉', '星颜骏', '132278310087', '中国建设银行', '6217002710000684874', '2017-11-26', '女', '', '118', '未完成');
INSERT INTO `orders` VALUES ('79', '雨刮器', '迈腾', '翠建柏', '139175426612', '招商银行', '6217002710000684874', '2017-09-07', '男', '', '178', '未完成');
INSERT INTO `orders` VALUES ('80', '金属刹车片', '宝骏', '谈诗兰', '136710148386', '招商银行', '6217002710000684874', '2017-12-08', '男', '', '4', '未完成');
INSERT INTO `orders` VALUES ('81', '蓄电池', '迈腾', '费永昌', '131377822830', '交通银行', '6217002710000684874', '2017-11-11', '男', '', '56', '未完成');
INSERT INTO `orders` VALUES ('82', '转向助力液', '宝骏', '苍佳悦', '135814964053', '中国建设银行', '6217002710000684874', '2017-11-08', '男', '', '92', '未完成');
INSERT INTO `orders` VALUES ('83', '转向助力液', '哈弗H6', '不宇达', '155652548141', '中国工商银行', '6217002710000684874', '2017-07-03', '男', '', '70', '未完成');
INSERT INTO `orders` VALUES ('84', '陶瓷刹车片', '卡罗拉', '锺离骏喆', '137905288760', '中信银行', '6217002710000684874', '2017-11-27', '女', '', '98', '未完成');
INSERT INTO `orders` VALUES ('85', '火花塞', '奥迪A4L', '杨哲瀚', '180308339169', '中国民生银行', '6217002710000684874', '2017-11-22', '男', '', '114', '未完成');
INSERT INTO `orders` VALUES ('86', '汽机油', '凯美瑞', '龙痴香', '152831933215', '中国工商银行', '6217002710000684874', '2017-12-28', '女', '', '184', '未完成');
INSERT INTO `orders` VALUES ('87', '蓄电池', '卡罗拉', '冉新立', '131168967658', '中国农业银行', '6217002710000684874', '2017-12-13', '男', '', '40', '未完成');
INSERT INTO `orders` VALUES ('88', '柴油机', '雅阁', '左英范', '186272896840', '中国民生银行', '6217002710000684874', '2017-09-23', '女', '', '172', '未完成');
INSERT INTO `orders` VALUES ('89', '转向助力液', '奥迪A9L', '理新雨', '188170026251', '中国农业银行', '6217002710000684874', '2017-10-20', '男', '', '52', '未完成');
INSERT INTO `orders` VALUES ('90', '火花塞', '宝骏', '盍依云', '130983907248', '上海浦东发展银行', '6217002710000684874', '2017-12-24', '男', '', '2', '未完成');
INSERT INTO `orders` VALUES ('91', '转向助力液', '迈腾', '潜辰锟', '135759438031', '中国邮政储蓄银行', '6217002710000684874', '2017-10-02', '男', '', '24', '未完成');
INSERT INTO `orders` VALUES ('92', '防冻液', '雅阁', '养德明', '187550937817', '上海浦东发展银行', '6217002710000684874', '2017-11-01', '男', '', '4', '未完成');
INSERT INTO `orders` VALUES ('93', '雨刮器', '凯美瑞', '令若雁', '159296771649', '中信银行', '6217002710000684874', '2017-06-27', '男', '', '116', '未完成');
INSERT INTO `orders` VALUES ('94', '防冻液', '宝马', '言宛亦', '134376774834', '交通银行', '6217002710000684874', '2017-12-15', '男', '', '178', '未完成');
INSERT INTO `orders` VALUES ('95', '柴油机', '宝来', '板忆辰', '186596698011', '中国建设银行', '6217002710000684874', '2017-11-22', '女', '', '86', '未完成');
INSERT INTO `orders` VALUES ('96', '柴油机', '宝骏', '沐夏柳', '133924487739', '中国工商银行', '6217002710000684874', '2017-06-29', '女', '', '164', '未完成');
INSERT INTO `orders` VALUES ('97', '雨刮器', '雅阁', '那拉曜瑞', '132854469810', '中国建设银行', '6217002710000684874', '2017-10-25', '男', '', '164', '未完成');
INSERT INTO `orders` VALUES ('98', '陶瓷刹车片', '英朗', '奇弘厚', '157516634329', '中国邮政储蓄银行', '6217002710000684874', '2017-10-29', '女', '', '176', '未完成');
INSERT INTO `orders` VALUES ('99', '陶瓷刹车片', '凯美瑞', '纳喇姣姣', '157589823152', '中国民生银行', '6217002710000684874', '2017-07-26', '女', '', '2', '未完成');
INSERT INTO `orders` VALUES ('100', '卡钳总成', '雅阁', '练俊风', '131517836565', '中国农业银行', '6217002710000684874', '2017-10-01', '女', '', '110', '未完成');
INSERT INTO `orders` VALUES ('101', '金属刹车片', '卡罗拉', '介星腾', '136389682929', '上海浦东发展银行', '6217002710000684874', '2017-11-12', '男', '', '80', '未完成');
INSERT INTO `orders` VALUES ('102', '柴油机', '英朗', '展飞翼', '153520806225', '交通银行', '6217002710000684874', '2017-06-30', '女', '', '88', '未完成');
INSERT INTO `orders` VALUES ('103', '柴油机', '宝马', '寻乐蓉', '133115709368', '招商银行', '6217002710000684874', '2017-11-12', '女', '', '126', '未完成');
INSERT INTO `orders` VALUES ('104', '卡钳总成', '哈弗H6', '禹元青', '158983142491', '招商银行', '6217002710000684874', '2017-10-30', '女', '', '106', '未完成');
INSERT INTO `orders` VALUES ('105', '金属刹车片', '迈腾', '卷坚壁', '136111125807', '中国工商银行', '6217002710000684874', '2017-10-17', '男', '', '152', '未完成');
INSERT INTO `orders` VALUES ('106', '转向助力液', '凯美瑞', '丑微熹', '155227708659', '招商银行', '6217002710000684874', '2017-07-23', '男', '', '6', '未完成');
INSERT INTO `orders` VALUES ('107', '转向助力液', '宝马', '留雯华', '135845188022', '中国民生银行', '6217002710000684874', '2017-11-26', '男', '', '176', '未完成');
INSERT INTO `orders` VALUES ('108', '金属刹车片', '奥迪A10L', '茹依萱', '189455513823', '中国建设银行', '6217002710000684874', '2017-08-24', '男', '', '18', '未完成');
INSERT INTO `orders` VALUES ('109', '转向助力液', '雅阁', '乌孙华藏', '188425137379', '中信银行', '6217002710000684874', '2017-12-25', '男', '', '170', '未完成');
INSERT INTO `orders` VALUES ('110', '雨刮器', '宝来', '杨密思', '132644734537', '中国邮政储蓄银行', '6217002710000684874', '2017-08-03', '男', '', '120', '未完成');
INSERT INTO `orders` VALUES ('111', '汽机油', '英朗', '闪德曜', '152457085877', '招商银行', '6217002710000684874', '2017-10-27', '女', '', '142', '未完成');
INSERT INTO `orders` VALUES ('112', '火花塞', '卡罗拉', '袁俊捷', '130350605362', '中国工商银行', '6217002710000684874', '2017-10-12', '男', '', '108', '未完成');
INSERT INTO `orders` VALUES ('113', '卡钳总成', '宝马', '函千凡', '138982984902', '中国邮政储蓄银行', '6217002710000684874', '2017-09-07', '女', '', '162', '未完成');
INSERT INTO `orders` VALUES ('114', '卡钳总成', '宝来', '窦娟丽', '131469661482', '中信银行', '6217002710000684874', '2017-07-19', '女', '', '164', '未完成');

-- ----------------------------
-- Table structure for `out_orders`
-- ----------------------------
DROP TABLE IF EXISTS `out_orders`;
CREATE TABLE `out_orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `parts_id` int(20) unsigned NOT NULL,
  `parts_name` char(50) NOT NULL,
  `number` int(20) NOT NULL,
  `order_id` int(20) unsigned NOT NULL,
  `date` date NOT NULL,
  `order_name` char(50) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `parts_id` (`parts_id`),
  CONSTRAINT `out_orders_ibfk_1` FOREIGN KEY (`parts_id`) REFERENCES `parts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of out_orders
-- ----------------------------
INSERT INTO `out_orders` VALUES ('13', '22', '转向助力液', '10', '56', '2018-06-13', '毛辰龙');
INSERT INTO `out_orders` VALUES ('14', '22', '转向助力液', '10', '56', '2018-06-20', '毛辰龙');

-- ----------------------------
-- Table structure for `parts`
-- ----------------------------
DROP TABLE IF EXISTS `parts`;
CREATE TABLE `parts` (
  `partsname` char(20) CHARACTER SET utf8 NOT NULL,
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `storage` int(10) unsigned zerofill DEFAULT NULL,
  `car` char(20) CHARACTER SET utf8 NOT NULL,
  `price` int(20) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `parts` (`partsname`)
) ENGINE=InnoDB AUTO_INCREMENT=117 DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of parts
-- ----------------------------
INSERT INTO `parts` VALUES ('火花塞', '17', '0000000130', '卡罗拉', '1800');
INSERT INTO `parts` VALUES ('蓄电池', '18', '0000000385', '卡罗拉', '800');
INSERT INTO `parts` VALUES ('汽机油', '19', '0000000445', '卡罗拉', '1100');
INSERT INTO `parts` VALUES ('柴油机', '20', '0000000155', '卡罗拉', '1300');
INSERT INTO `parts` VALUES ('防冻液', '21', '0000000105', '卡罗拉', '1900');
INSERT INTO `parts` VALUES ('转向助力液', '22', '0000000080', '卡罗拉', '200');
INSERT INTO `parts` VALUES ('金属刹车片', '23', '0000000455', '卡罗拉', '1900');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '24', '0000000420', '卡罗拉', '2000');
INSERT INTO `parts` VALUES ('卡钳总成', '25', '0000000060', '卡罗拉', '1300');
INSERT INTO `parts` VALUES ('雨刮器', '26', '0000000190', '卡罗拉', '1300');
INSERT INTO `parts` VALUES ('火花塞', '27', '0000000490', '英朗', '800');
INSERT INTO `parts` VALUES ('蓄电池', '28', '0000000030', '英朗', '1300');
INSERT INTO `parts` VALUES ('汽机油', '29', '0000000380', '英朗', '400');
INSERT INTO `parts` VALUES ('柴油机', '30', '0000000005', '英朗', '1700');
INSERT INTO `parts` VALUES ('防冻液', '31', '0000000045', '英朗', '1300');
INSERT INTO `parts` VALUES ('转向助力液', '32', '0000000215', '英朗', '1400');
INSERT INTO `parts` VALUES ('金属刹车片', '33', '0000000420', '英朗', '1900');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '34', '0000000400', '英朗', '1600');
INSERT INTO `parts` VALUES ('卡钳总成', '35', '0000000450', '英朗', '1500');
INSERT INTO `parts` VALUES ('雨刮器', '36', '0000000250', '英朗', '1900');
INSERT INTO `parts` VALUES ('火花塞', '37', '0000000435', '雅阁', '900');
INSERT INTO `parts` VALUES ('蓄电池', '38', '0000000070', '雅阁', '1500');
INSERT INTO `parts` VALUES ('汽机油', '39', '0000000335', '雅阁', '1900');
INSERT INTO `parts` VALUES ('柴油机', '40', '0000000410', '雅阁', '1600');
INSERT INTO `parts` VALUES ('防冻液', '41', '0000000015', '雅阁', '800');
INSERT INTO `parts` VALUES ('转向助力液', '42', '0000000335', '雅阁', '300');
INSERT INTO `parts` VALUES ('金属刹车片', '43', '0000000470', '雅阁', '1200');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '44', '0000000330', '雅阁', '900');
INSERT INTO `parts` VALUES ('卡钳总成', '45', '0000000280', '雅阁', '1600');
INSERT INTO `parts` VALUES ('雨刮器', '46', '0000000135', '雅阁', '300');
INSERT INTO `parts` VALUES ('火花塞', '47', '0000000040', '迈腾', '1800');
INSERT INTO `parts` VALUES ('蓄电池', '48', '0000000065', '迈腾', '1900');
INSERT INTO `parts` VALUES ('汽机油', '49', '0000000370', '迈腾', '1100');
INSERT INTO `parts` VALUES ('柴油机', '50', '0000000130', '迈腾', '700');
INSERT INTO `parts` VALUES ('防冻液', '51', '0000000390', '迈腾', '1600');
INSERT INTO `parts` VALUES ('转向助力液', '52', '0000000390', '迈腾', '500');
INSERT INTO `parts` VALUES ('金属刹车片', '53', '0000000340', '迈腾', '1400');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '54', '0000000225', '迈腾', '1200');
INSERT INTO `parts` VALUES ('卡钳总成', '55', '0000000060', '迈腾', '1400');
INSERT INTO `parts` VALUES ('雨刮器', '56', '0000000100', '迈腾', '1200');
INSERT INTO `parts` VALUES ('火花塞', '57', '0000000305', '哈弗H6', '1000');
INSERT INTO `parts` VALUES ('蓄电池', '58', '0000000050', '哈弗H6', '1900');
INSERT INTO `parts` VALUES ('汽机油', '59', '0000000055', '哈弗H6', '300');
INSERT INTO `parts` VALUES ('柴油机', '60', '0000000330', '哈弗H6', '1000');
INSERT INTO `parts` VALUES ('防冻液', '61', '0000000435', '哈弗H6', '1100');
INSERT INTO `parts` VALUES ('转向助力液', '62', '0000000235', '哈弗H6', '300');
INSERT INTO `parts` VALUES ('金属刹车片', '63', '0000000350', '哈弗H6', '600');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '64', '0000000140', '哈弗H6', '500');
INSERT INTO `parts` VALUES ('卡钳总成', '65', '0000000215', '哈弗H6', '100');
INSERT INTO `parts` VALUES ('雨刮器', '66', '0000000345', '哈弗H6', '1000');
INSERT INTO `parts` VALUES ('火花塞', '67', '0000000080', '奥迪A4L', '600');
INSERT INTO `parts` VALUES ('蓄电池', '68', '0000000060', '奥迪A5L', '2000');
INSERT INTO `parts` VALUES ('汽机油', '69', '0000000410', '奥迪A6L', '1500');
INSERT INTO `parts` VALUES ('柴油机', '70', '0000000380', '奥迪A7L', '1400');
INSERT INTO `parts` VALUES ('防冻液', '71', '0000000475', '奥迪A8L', '300');
INSERT INTO `parts` VALUES ('转向助力液', '72', '0000000475', '奥迪A9L', '200');
INSERT INTO `parts` VALUES ('金属刹车片', '73', '0000000130', '奥迪A10L', '1500');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '74', '0000000100', '奥迪A11L', '800');
INSERT INTO `parts` VALUES ('卡钳总成', '75', '0000000375', '奥迪A12L', '900');
INSERT INTO `parts` VALUES ('雨刮器', '76', '0000000260', '奥迪A13L', '2000');
INSERT INTO `parts` VALUES ('火花塞', '77', '0000000250', '宝骏', '1800');
INSERT INTO `parts` VALUES ('蓄电池', '78', '0000000030', '宝骏', '1900');
INSERT INTO `parts` VALUES ('汽机油', '79', '0000000480', '宝骏', '900');
INSERT INTO `parts` VALUES ('柴油机', '80', '0000000380', '宝骏', '1300');
INSERT INTO `parts` VALUES ('防冻液', '81', '0000000265', '宝骏', '300');
INSERT INTO `parts` VALUES ('转向助力液', '82', '0000000105', '宝骏', '1300');
INSERT INTO `parts` VALUES ('金属刹车片', '83', '0000000315', '宝骏', '1500');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '84', '0000000355', '宝骏', '900');
INSERT INTO `parts` VALUES ('卡钳总成', '85', '0000000455', '宝骏', '800');
INSERT INTO `parts` VALUES ('雨刮器', '86', '0000000395', '宝骏', '1100');
INSERT INTO `parts` VALUES ('火花塞', '87', '0000000290', '凯美瑞', '900');
INSERT INTO `parts` VALUES ('蓄电池', '88', '0000000020', '凯美瑞', '1500');
INSERT INTO `parts` VALUES ('汽机油', '89', '0000000055', '凯美瑞', '2000');
INSERT INTO `parts` VALUES ('柴油机', '90', '0000000440', '凯美瑞', '500');
INSERT INTO `parts` VALUES ('防冻液', '91', '0000000295', '凯美瑞', '1800');
INSERT INTO `parts` VALUES ('转向助力液', '92', '0000000180', '凯美瑞', '1600');
INSERT INTO `parts` VALUES ('金属刹车片', '93', '0000000495', '凯美瑞', '1400');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '94', '0000000485', '凯美瑞', '1800');
INSERT INTO `parts` VALUES ('卡钳总成', '95', '0000000280', '凯美瑞', '1000');
INSERT INTO `parts` VALUES ('雨刮器', '96', '0000000460', '凯美瑞', '100');
INSERT INTO `parts` VALUES ('火花塞', '97', '0000000115', '宝来', '1900');
INSERT INTO `parts` VALUES ('蓄电池', '98', '0000000225', '宝来', '400');
INSERT INTO `parts` VALUES ('汽机油', '99', '0000000500', '宝来', '300');
INSERT INTO `parts` VALUES ('柴油机', '100', '0000000370', '宝来', '1000');
INSERT INTO `parts` VALUES ('防冻液', '101', '0000000080', '宝来', '900');
INSERT INTO `parts` VALUES ('转向助力液', '102', '0000000150', '宝来', '500');
INSERT INTO `parts` VALUES ('金属刹车片', '103', '0000000325', '宝来', '1400');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '104', '0000000360', '宝来', '1000');
INSERT INTO `parts` VALUES ('卡钳总成', '105', '0000000035', '宝来', '1900');
INSERT INTO `parts` VALUES ('雨刮器', '106', '0000000320', '宝来', '1800');
INSERT INTO `parts` VALUES ('火花塞', '107', '0000000070', '宝马', '1400');
INSERT INTO `parts` VALUES ('蓄电池', '108', '0000000170', '宝马', '500');
INSERT INTO `parts` VALUES ('汽机油', '109', '0000000415', '宝马', '1800');
INSERT INTO `parts` VALUES ('柴油机', '110', '0000000205', '宝马', '300');
INSERT INTO `parts` VALUES ('防冻液', '111', '0000000280', '宝马', '100');
INSERT INTO `parts` VALUES ('转向助力液', '112', '0000000290', '宝马', '200');
INSERT INTO `parts` VALUES ('金属刹车片', '113', '0000000435', '宝马', '1700');
INSERT INTO `parts` VALUES ('陶瓷刹车片', '114', '0000000230', '宝马', '1200');
INSERT INTO `parts` VALUES ('卡钳总成', '115', '0000000205', '宝马', '2000');
INSERT INTO `parts` VALUES ('雨刮器', '116', '0000000180', '宝马', '200');
